coanda/inc_soln/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          130;
        startFace       206740;
    }
    right
    {
        type            patch;
        nFaces          480;
        startFace       206870;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          150;
        startFace       207350;
    }
    meanFlow
    {
        type            patch;
        nFaces          200;
        startFace       207500;
    }
    surface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1480;
        startFace       207700;
    }
    coandaInlet
    {
        type            patch;
        nFaces          80;
        startFace       209180;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          208000;
        startFace       209260;
    }
)

// ************************************************************************* //
